package dynamicplan

func maxProfit(prices []int) int {
	/*
		123. 买卖股票的最佳时机 III

		给定一个数组，它的第 i 个元素是一支给定的股票在第 i 天的价格。
		设计一个算法来计算你所能获取的最大利润。你最多可以完成 两笔 交易。
		注意：你不能同时参与多笔交易（你必须在再次购买前出售掉之前的股票）。

		输入：prices = [3,3,5,0,0,3,1,4]
		输出：6
		解释：在第 4 天（股票价格 = 0）的时候买入，在第 6 天（股票价格 = 3）的时候卖出，这笔交易所能获得利润 = 3-0 = 3 。
		     随后，在第 7 天（股票价格 = 1）的时候买入，在第 8 天 （股票价格 = 4）的时候卖出，这笔交易所能获得利润 = 4-1 = 3 。

		输入：prices = [1,2,3,4,5]
		输出：4
		解释：在第 1 天（股票价格 = 1）的时候买入，在第 5 天 （股票价格 = 5）的时候卖出, 这笔交易所能获得利润 = 5-1 = 4 。
		     注意你不能在第 1 天和第 2 天接连购买股票，之后再将它们卖出。
		     因为这样属于同时参与了多笔交易，你必须在再次购买前出售掉之前的股票。

		输入：prices = [7,6,4,3,1]
		输出：0
		解释：在这个情况下, 没有交易完成, 所以最大利润为 0。
	*/
	// 最多选择两次（买入-卖出），计算最大利润
	// 假设只能完成一笔交易，则找出左侧最小值，假设在 i 卖出，计算 price_i = max(prices[i] - min, 0) 就好了
	// 如果可以多次交易（两笔），那先得出第一笔，然后对剩下的区间计算第二笔，两者相加，如果能事先计算每个区间的最小值就好了
	// 怎么表示：dp[i][j] 第一笔在 i 卖出，第二笔在 j 卖出？ 但是不一定有j呀，那就 j 为 0 表示？

	// 实际逻辑：考虑在 i 天，不做操作，买入第一次 buy1，卖出第一次sell1，买入第二次buy2，卖出第二次sell2，有5个操作
	// 不做操作利润为0，可以忽略
	n := len(prices)
	if n == 0 {
		return 0
	}

	buy1, sell1 := -prices[0], 0 // 当天买当天卖 sell1=0
	buy2, sell2 := -prices[0], 0

	for i := 1; i < n; i++ {
		buy1 = max(buy1, -prices[i])
		sell1 = max(sell1, buy1+prices[i])
		buy2 = max(buy2, sell1-prices[i])
		sell2 = max(sell2, buy2+prices[i])
	}
	return sell2
}
